In [1]:
import pandas as pd
import sqlalchemy

In [2]:
df1 = pd.read_csv("data/customer_data.csv")
df1

      customer_id  gender   age payment_method
0         C241288  Female  28.0    Credit Card
1         C111565    Male  21.0     Debit Card
2         C266599    Male  20.0           Cash
3         C988172  Female  66.0    Credit Card
4         C189076  Female  53.0           Cash
...           ...     ...   ...            ...
99452     C441542  Female  45.0    Credit Card
99453     C569580    Male  27.0           Cash
99454     C103292    Male  63.0     Debit Card
99455     C800631    Male  56.0           Cash
99456     C273973  Female  36.0    Credit Card

[99457 rows x 4 columns]

### read customer data from pg admin DB
### customer_data is uploaded in pdAdmin DB as customer_payment

### creates a connection between Python and PostgreSQL db

In [11]:
engine = sqlalchemy.create_engine('postgresql://postgres:ADMIN321@localhost:5432/krittik')

### format of connection url 

'postgresql://user:password@localhost:5432/dbname'

bydefault user for pgAdmin is  :: postgresql

In [14]:
df = pd.read_sql_table("customer_payment",engine)
df

      customer_id  gender   age payment_method
0         C241288  Female  28.0    Credit Card
1         C111565    Male  21.0     Debit Card
2         C266599    Male  20.0           Cash
3         C988172  Female  66.0    Credit Card
4         C189076  Female  53.0           Cash
...           ...     ...   ...            ...
99452     C441542  Female  45.0    Credit Card
99453     C569580    Male  27.0           Cash
99454     C103292    Male  63.0     Debit Card
99455     C800631    Male  56.0           Cash
99456     C273973  Female  36.0    Credit Card

[99457 rows x 4 columns]

In [15]:
df1 = df.dropna()
df1

      customer_id  gender   age payment_method
0         C241288  Female  28.0    Credit Card
1         C111565    Male  21.0     Debit Card
2         C266599    Male  20.0           Cash
3         C988172  Female  66.0    Credit Card
4         C189076  Female  53.0           Cash
...           ...     ...   ...            ...
99452     C441542  Female  45.0    Credit Card
99453     C569580    Male  27.0           Cash
99454     C103292    Male  63.0     Debit Card
99455     C800631    Male  56.0           Cash
99456     C273973  Female  36.0    Credit Card

[99338 rows x 4 columns]

In [19]:
df1[["customer_id", "payment_method"]]

      customer_id payment_method
0         C241288    Credit Card
1         C111565     Debit Card
2         C266599           Cash
3         C988172    Credit Card
4         C189076           Cash
...           ...            ...
99452     C441542    Credit Card
99453     C569580           Cash
99454     C103292     Debit Card
99455     C800631           Cash
99456     C273973    Credit Card

[99338 rows x 2 columns]

### run pg query directely from python

In [21]:
query = """
SELECT *
FROM customer_payment
WHERE payment_method = 'Cash'
"""

df = pd.read_sql_query(query, engine)
df

      customer_id  gender   age payment_method
0         C266599    Male  20.0           Cash
1         C189076  Female  53.0           Cash
2         C151197  Female  49.0           Cash
3         C240286  Female  36.0           Cash
4         C312861    Male  25.0           Cash
...           ...     ...   ...            ...
44442     C953724    Male  65.0           Cash
44443     C226974  Female  28.0           Cash
44444     C513603    Male  50.0           Cash
44445     C569580    Male  27.0           Cash
44446     C800631    Male  56.0           Cash

[44447 rows x 4 columns]